{"ACCEPT_HANDOVER": ["dangerous", "Allows a calling app to continue a call which was started in another app.  An example is a\n video calling app that wants to continue a voice call on the user's mobile network."], "ACCESS_BACKGROUND_LOCATION": ["dangerous", "Allows an app to access location in the background. If you're requesting this permission,\n you must also request either"], "ACCESS_BLOBS_ACROSS_USERS": ["normal", "Allows an application to access data blobs across users."], "ACCESS_CHECKIN_PROPERTIES": ["normal", "Allows read/write access to the \"properties\" table in the checkin\n database, to change values that get uploaded."], "ACCESS_COARSE_LOCATION": ["dangerous", "Allows an app to access approximate location.\n Alternatively, you might want"], "ACCESS_FINE_LOCATION": ["dangerous", "Allows an app to access precise location.\n Alternatively, you might want"], "ACCESS_LOCATION_EXTRA_COMMANDS": ["normal", "Allows an application to access extra location provider commands."], "ACCESS_MEDIA_LOCATION": ["dangerous", "Allows an application to access any geographic locations persisted in the\n user's shared collection."], "ACCESS_NETWORK_STATE": ["normal", "Allows applications to access information about networks."], "ACCESS_NOTIFICATION_POLICY": ["normal", "Marker permission for applications that wish to access notification policy. This permission\n is not supported on managed profiles."], "ACCESS_WIFI_STATE": ["normal", "Allows applications to access information about Wi-Fi networks."], "ACCOUNT_MANAGER": ["normal", "Allows applications to call into AccountAuthenticators."], "ACTIVITY_RECOGNITION": ["dangerous", "Allows an application to recognize physical activity."], "ADD_VOICEMAIL": ["dangerous", "Allows an application to add voicemails into the system."], "ANSWER_PHONE_CALLS": ["dangerous", "Allows the app to answer an incoming phone call."], "BATTERY_STATS": ["signature", "Allows an application to collect battery statistics"], "BIND_ACCESSIBILITY_SERVICE": ["signature", "Must be required by an"], "BIND_APPWIDGET": ["normal", "Allows an application to tell the AppWidget service which application\n can access AppWidget's data.  The normal user flow is that a user\n picks an AppWidget to go into a particular host, thereby giving that\n host application access to the private data from the AppWidget app.\n An application that has this permission should honor that contract."], "BIND_AUTOFILL_SERVICE": ["signature", "Must be required by a"], "BIND_CALL_REDIRECTION_SERVICE": ["signature", "Must be required by a"], "BIND_CARRIER_MESSAGING_CLIENT_SERVICE": ["signature", "A subclass of"], "BIND_CARRIER_MESSAGING_SERVICE": ["normal", "BIND_CARRIER_MESSAGING_SERVICE"], "BIND_CARRIER_SERVICES": ["signature", "The system process that is allowed to bind to services in carrier apps will\n have this permission. Carrier apps should use this permission to protect\n their services that only the system is allowed to bind to."], "BIND_CHOOSER_TARGET_SERVICE": ["signature", "BIND_CHOOSER_TARGET_SERVICE"], "BIND_COMPANION_DEVICE_SERVICE": ["normal", "Must be required by any"], "BIND_CONDITION_PROVIDER_SERVICE": ["signature", "Must be required by a"], "BIND_CONTROLS": ["normal", "Allows SystemUI to request third party controls."], "BIND_DEVICE_ADMIN": ["signature", "Must be required by device administration receiver, to ensure that only the\n system can interact with it."], "BIND_DREAM_SERVICE": ["signature", "Must be required by an"], "BIND_INCALL_SERVICE": ["signature", "Must be required by a"], "BIND_INPUT_METHOD": ["signature", "Must be required by an"], "BIND_MIDI_DEVICE_SERVICE": ["signature", "Must be required by an"], "BIND_NFC_SERVICE": ["signature", "Must be required by a"], "BIND_NOTIFICATION_LISTENER_SERVICE": ["signature", "Must be required by an"], "BIND_PRINT_SERVICE": ["signature", "Must be required by a"], "BIND_QUICK_ACCESS_WALLET_SERVICE": ["signature", "Must be required by a"], "BIND_QUICK_SETTINGS_TILE": ["normal", "Allows an application to bind to third party quick settings tiles."], "BIND_REMOTEVIEWS": ["signature", "Must be required by a"], "BIND_SCREENING_SERVICE": ["signature", "Must be required by a"], "BIND_TELECOM_CONNECTION_SERVICE": ["signature", "Must be required by a"], "BIND_TEXT_SERVICE": ["signature", "Must be required by a TextService (e.g. SpellCheckerService)\n to ensure that only the system can bind to it."], "BIND_TV_INPUT": ["signature", "Must be required by a"], "BIND_TV_INTERACTIVE_APP": ["signature", "Must be required by a"], "BIND_VISUAL_VOICEMAIL_SERVICE": ["signature", "Must be required by a link"], "BIND_VOICE_INTERACTION": ["signature", "Must be required by a"], "BIND_VPN_SERVICE": ["signature", "Must be required by a"], "BIND_VR_LISTENER_SERVICE": ["signature", "Must be required by an"], "BIND_WALLPAPER": ["signature", "Must be required by a"], "BLUETOOTH": ["normal", "Allows applications to connect to paired bluetooth devices."], "BLUETOOTH_ADMIN": ["normal", "Allows applications to discover and pair bluetooth devices."], "BLUETOOTH_ADVERTISE": ["dangerous", "Required to be able to advertise to nearby Bluetooth devices."], "BLUETOOTH_CONNECT": ["dangerous", "Required to be able to connect to paired Bluetooth devices."], "BLUETOOTH_PRIVILEGED": ["normal", "Allows applications to pair bluetooth devices without user interaction, and to\n allow or disallow phonebook access or message access."], "BLUETOOTH_SCAN": ["dangerous", "Required to be able to discover and pair nearby Bluetooth devices."], "BODY_SENSORS": ["dangerous", "Allows an application to access data from sensors that the user uses to\n measure what is happening inside their body, such as heart rate."], "BODY_SENSORS_BACKGROUND": ["dangerous", "Allows an application to access data from sensors that the user uses to measure what is\n happening inside their body, such as heart rate. If you're requesting this permission, you\n must also request"], "BROADCAST_PACKAGE_REMOVED": ["normal", "Allows an application to broadcast a notification that an application\n package has been removed."], "BROADCAST_SMS": ["normal", "Allows an application to broadcast an SMS receipt notification."], "BROADCAST_STICKY": ["normal", "Allows an application to broadcast sticky intents.  These are\n broadcasts whose data is held by the system after being finished,\n so that clients can quickly retrieve that data without having\n to wait for the next broadcast."], "BROADCAST_WAP_PUSH": ["normal", "Allows an application to broadcast a WAP PUSH receipt notification."], "CALL_COMPANION_APP": ["normal", "Allows an app which implements the"], "CALL_PHONE": ["dangerous", "Allows an application to initiate a phone call without going through\n the Dialer user interface for the user to confirm the call."], "CALL_PRIVILEGED": ["normal", "Allows an application to call any phone number, including emergency\n numbers, without going through the Dialer user interface for the user\n to confirm the call being placed."], "CAMERA": ["dangerous", "Required to be able to access the camera device."], "CAPTURE_AUDIO_OUTPUT": ["normal", "Allows an application to capture audio output.\n Use the"], "CHANGE_COMPONENT_ENABLED_STATE": ["normal", "Allows an application to change whether an application component (other than its own) is\n enabled or not."], "CHANGE_CONFIGURATION": ["signature", "Allows an application to modify the current configuration, such\n as locale."], "CHANGE_NETWORK_STATE": ["normal", "Allows applications to change network connectivity state."], "CHANGE_WIFI_MULTICAST_STATE": ["normal", "Allows applications to enter Wi-Fi Multicast mode."], "CHANGE_WIFI_STATE": ["normal", "Allows applications to change Wi-Fi connectivity state."], "CLEAR_APP_CACHE": ["signature", "Allows an application to clear the caches of all installed\n applications on the device."], "CONTROL_LOCATION_UPDATES": ["normal", "Allows enabling/disabling location update notifications from\n the radio."], "DELETE_CACHE_FILES": ["signature", "Old permission for deleting an app's cache files, no longer used,\n but signals for us to quietly ignore calls instead of throwing an exception."], "DELETE_PACKAGES": ["normal", "Allows an application to delete packages."], "DELIVER_COMPANION_MESSAGES": ["normal", "Allows an application to deliver companion messages to system"], "DIAGNOSTIC": ["normal", "Allows applications to RW to diagnostic resources."], "DISABLE_KEYGUARD": ["normal", "Allows applications to disable the keyguard if it is not secure."], "DUMP": ["normal", "Allows an application to retrieve state dump information from system services."], "EXPAND_STATUS_BAR": ["normal", "Allows an application to expand or collapse the status bar."], "FACTORY_TEST": ["normal", "Run as a manufacturer test application, running as the root user.\n Only available when the device is running in manufacturer test mode."], "FOREGROUND_SERVICE": ["normal", "Allows a regular application to use"], "GET_ACCOUNTS": ["dangerous", "Allows access to the list of accounts in the Accounts Service."], "GET_ACCOUNTS_PRIVILEGED": ["signature", "Allows access to the list of accounts in the Accounts Service."], "GET_PACKAGE_SIZE": ["normal", "Allows an application to find out the space used by any package."], "GET_TASKS": ["normal", "GET_TASKS"], "GLOBAL_SEARCH": ["signature", "This permission can be used on content providers to allow the global\n search system to access their data.  Typically it used when the\n provider has some permissions protecting it (which global search\n would not be expected to hold), and added as a read-only permission\n to the path in the provider where global search queries are\n performed.  This permission can not be held by regular applications;\n it is used by applications to protect themselves from everyone else\n besides global search."], "HIDE_OVERLAY_WINDOWS": ["normal", "Allows an app to prevent non-system-overlay windows from being drawn on top of it"], "HIGH_SAMPLING_RATE_SENSORS": ["normal", "Allows an app to access sensor data with a sampling rate greater than 200 Hz."], "INSTALL_LOCATION_PROVIDER": ["normal", "Allows an application to install a location provider into the Location Manager."], "INSTALL_PACKAGES": ["normal", "Allows an application to install packages."], "INSTALL_SHORTCUT": ["normal", "Allows an application to install a shortcut in Launcher."], "INSTANT_APP_FOREGROUND_SERVICE": ["signature", "Allows an instant app to create foreground services."], "INTERACT_ACROSS_PROFILES": ["normal", "Allows interaction across profiles in the same profile group."], "INTERNET": ["normal", "Allows applications to open network sockets."], "KILL_BACKGROUND_PROCESSES": ["normal", "Allows an application to call"], "LAUNCH_MULTI_PANE_SETTINGS_DEEP_LINK": ["normal", "An application needs this permission for"], "LOADER_USAGE_STATS": ["signature", "Allows a data loader to read a package's access logs. The access logs contain the\n set of pages referenced over time."], "LOCATION_HARDWARE": ["normal", "Allows an application to use location features in hardware,\n such as the geofencing api."], "MANAGE_DOCUMENTS": ["normal", "Allows an application to manage access to documents, usually as part\n of a document picker."], "MANAGE_EXTERNAL_STORAGE": ["signature", "Allows an application a broad access to external storage in scoped storage.\n Intended to be used by few apps that need to manage files on behalf of the users."], "MANAGE_MEDIA": ["signature", "Allows an application to modify and delete media files on this device or any connected\n storage device without user confirmation. Applications must already be granted the"], "MANAGE_ONGOING_CALLS": ["signature", "Allows to query ongoing call details and manage ongoing calls"], "MANAGE_OWN_CALLS": ["normal", "Allows a calling application which manages its own calls through the self-managed"], "MANAGE_WIFI_INTERFACES": ["normal", "Allows applications to get notified when a Wi-Fi interface request cannot\n be satisfied without tearing down one or more other interfaces, and provide a decision\n whether to approve the request or reject it."], "MANAGE_WIFI_NETWORK_SELECTION": ["normal", "This permission is used to let OEMs grant their trusted app access to a subset of\n privileged wifi APIs to improve wifi performance. Allows applications to manage\n Wi-Fi network selection related features such as enable or disable global auto-join,\n modify connectivity scan intervals, and approve Wi-Fi Direct connections."], "MASTER_CLEAR": ["normal", "Not for use by third-party applications."], "MEDIA_CONTENT_CONTROL": ["normal", "Allows an application to know what content is playing and control its playback."], "MODIFY_AUDIO_SETTINGS": ["normal", "Allows an application to modify global audio settings."], "MODIFY_PHONE_STATE": ["normal", "Allows modification of the telephony state - power on, mmi, etc.\n Does not include placing calls."], "MOUNT_FORMAT_FILESYSTEMS": ["normal", "Allows formatting file systems for removable storage."], "MOUNT_UNMOUNT_FILESYSTEMS": ["normal", "Allows mounting and unmounting file systems for removable storage."], "NEARBY_WIFI_DEVICES": ["dangerous", "Required to be able to advertise and connect to nearby devices via Wi-Fi."], "NFC": ["normal", "Allows applications to perform I/O operations over NFC."], "NFC_PREFERRED_PAYMENT_INFO": ["normal", "Allows applications to receive NFC preferred payment service information."], "NFC_TRANSACTION_EVENT": ["normal", "Allows applications to receive NFC transaction events."], "OVERRIDE_WIFI_CONFIG": ["normal", "Allows an application to modify any wifi configuration, even if created\n by another application. Once reconfigured the original creator cannot make any further\n modifications."], "PACKAGE_USAGE_STATS": ["signature", "Allows an application to collect component usage\n statistics"], "PERSISTENT_ACTIVITY": ["normal", "PERSISTENT_ACTIVITY"], "POST_NOTIFICATIONS": ["dangerous", "Allows an app to post notifications"], "PROCESS_OUTGOING_CALLS": ["dangerous", "PROCESS_OUTGOING_CALLS"], "QUERY_ALL_PACKAGES": ["normal", "Allows query of any normal app on the device, regardless of manifest declarations."], "READ_ASSISTANT_APP_SEARCH_DATA": ["normal", "Allows an application to query over global data in AppSearch that's visible to the\n ASSISTANT role."], "READ_BASIC_PHONE_STATE": ["normal", "Allows read only access to phone state with a non dangerous permission,\n including the information like cellular network type, software version."], "READ_CALENDAR": ["dangerous", "Allows an application to read the user's calendar data."], "READ_CALL_LOG": ["dangerous", "Allows an application to read the user's call log."], "READ_CONTACTS": ["dangerous", "Allows an application to read the user's contacts data."], "READ_EXTERNAL_STORAGE": ["dangerous", "Allows an application to read from external storage."], "READ_HOME_APP_SEARCH_DATA": ["normal", "Allows an application to query over global data in AppSearch that's visible to the\n HOME role."], "READ_INPUT_STATE": ["normal", "READ_INPUT_STATE"], "READ_LOGS": ["normal", "Allows an application to read the low-level system log files."], "READ_MEDIA_AUDIO": ["dangerous", "Allows an application to read audio files from external storage."], "READ_MEDIA_IMAGES": ["dangerous", "Allows an application to read image files from external storage."], "READ_MEDIA_VIDEO": ["dangerous", "Allows an application to read video files from external storage."], "READ_NEARBY_STREAMING_POLICY": ["normal", "Allows an application to read nearby streaming policy. The policy controls\n whether to allow the device to stream its notifications and apps to nearby devices.\n Applications that are not the device owner will need this permission to call"], "READ_PHONE_NUMBERS": ["dangerous", "Allows read access to the device's phone number(s). This is a subset of the capabilities\n granted by"], "READ_PHONE_STATE": ["dangerous", "Allows read only access to phone state, including the current cellular network information,\n the status of any ongoing calls, and a list of any"], "READ_PRECISE_PHONE_STATE": ["normal", "Allows read only access to precise phone state.\n Allows reading of detailed information about phone state for special-use applications\n such as dialers, carrier applications, or ims applications."], "READ_SMS": ["dangerous", "Allows an application to read SMS messages."], "READ_SYNC_SETTINGS": ["normal", "Allows applications to read the sync settings."], "READ_SYNC_STATS": ["normal", "Allows applications to read the sync stats."], "READ_VOICEMAIL": ["signature", "Allows an application to read voicemails in the system."], "REBOOT": ["normal", "Required to be able to reboot the device."], "RECEIVE_BOOT_COMPLETED": ["normal", "Allows an application to receive the"], "RECEIVE_MMS": ["dangerous", "Allows an application to monitor incoming MMS messages."], "RECEIVE_SMS": ["dangerous", "Allows an application to receive SMS messages."], "RECEIVE_WAP_PUSH": ["dangerous", "Allows an application to receive WAP push messages."], "RECORD_AUDIO": ["dangerous", "Allows an application to record audio."], "REORDER_TASKS": ["normal", "Allows an application to change the Z-order of tasks."], "REQUEST_COMPANION_PROFILE_APP_STREAMING": ["normal", "Allows application to request to be associated with a virtual display capable of streaming\n Android applications\n ("], "REQUEST_COMPANION_PROFILE_AUTOMOTIVE_PROJECTION": ["normal", "Allows application to request to be associated with a vehicle head unit capable of\n automotive projection\n ("], "REQUEST_COMPANION_PROFILE_COMPUTER": ["normal", "Allows application to request to be associated with a computer to share functionality\n and/or data with other devices, such as notifications, photos and media\n ("], "REQUEST_COMPANION_PROFILE_WATCH": ["normal", "Allows app to request to be associated with a device via"], "REQUEST_COMPANION_RUN_IN_BACKGROUND": ["normal", "Allows a companion app to run in the background. This permission implies"], "REQUEST_COMPANION_SELF_MANAGED": ["normal", "Allows an application to create a \"self-managed\" association."], "REQUEST_COMPANION_START_FOREGROUND_SERVICES_FROM_BACKGROUND": ["normal", "Allows a companion app to start a foreground service from the background."], "REQUEST_COMPANION_USE_DATA_IN_BACKGROUND": ["normal", "Allows a companion app to use data in the background."], "REQUEST_DELETE_PACKAGES": ["normal", "Allows an application to request deleting packages. Apps\n targeting APIs"], "REQUEST_IGNORE_BATTERY_OPTIMIZATIONS": ["normal", "Permission an application must hold in order to use"], "REQUEST_INSTALL_PACKAGES": ["signature", "Allows an application to request installing packages. Apps\n targeting APIs greater than 25 must hold this permission in\n order to use"], "REQUEST_OBSERVE_COMPANION_DEVICE_PRESENCE": ["normal", "Allows an application to subscribe to notifications about the presence status change\n of their associated companion device"], "REQUEST_PASSWORD_COMPLEXITY": ["normal", "Allows an application to request the screen lock complexity and prompt users to update the\n screen lock to a certain complexity level."], "RESTART_PACKAGES": ["normal", "RESTART_PACKAGES"], "SCHEDULE_EXACT_ALARM": ["normal", "Allows applications to use exact alarm APIs."], "SEND_RESPOND_VIA_MESSAGE": ["normal", "Allows an application (Phone) to send a request to other applications\n to handle the respond-via-message action during incoming calls."], "SEND_SMS": ["dangerous", "Allows an application to send SMS messages."], "SET_ALARM": ["normal", "Allows an application to broadcast an Intent to set an alarm for the user."], "SET_ALWAYS_FINISH": ["normal", "Allows an application to control whether activities are immediately\n finished when put in the background."], "SET_ANIMATION_SCALE": ["normal", "Modify the global animation scaling factor."], "SET_DEBUG_APP": ["normal", "Configure an application for debugging."], "SET_PREFERRED_APPLICATIONS": ["normal", "SET_PREFERRED_APPLICATIONS"], "SET_PROCESS_LIMIT": ["normal", "Allows an application to set the maximum number of (not needed)\n application processes that can be running."], "SET_TIME": ["normal", "Allows applications to set the system time directly."], "SET_TIME_ZONE": ["normal", "Allows applications to set the system time zone directly."], "SET_WALLPAPER": ["normal", "Allows applications to set the wallpaper."], "SET_WALLPAPER_HINTS": ["normal", "Allows applications to set the wallpaper hints."], "SIGNAL_PERSISTENT_PROCESSES": ["normal", "Allow an application to request that a signal be sent to all persistent processes."], "SMS_FINANCIAL_TRANSACTIONS": ["signature", "SMS_FINANCIAL_TRANSACTIONS"], "START_FOREGROUND_SERVICES_FROM_BACKGROUND": ["normal", "Allows an application to start foreground services from the background at any time."], "START_VIEW_APP_FEATURES": ["signature", "Allows the holder to start the screen with a list of app features."], "START_VIEW_PERMISSION_USAGE": ["signature", "Allows the holder to start the permission usage screen for an app."], "STATUS_BAR": ["normal", "Allows an application to open, close, or disable the status bar\n and its icons."], "SUBSCRIBE_TO_KEYGUARD_LOCKED_STATE": ["internal", "Allows an application to subscribe to keyguard locked (i.e., showing) state."], "SYSTEM_ALERT_WINDOW": ["signature", "Allows an app to create windows using the type"], "TRANSMIT_IR": ["normal", "Allows using the device's IR transmitter, if available."], "UNINSTALL_SHORTCUT": ["normal", "<p class=\"caution\"><strong>Don't use this permission in your app.</strong><br/>This\n permission is no longer supported.</p>"], "UPDATE_DEVICE_STATS": ["normal", "Allows an application to update device statistics."], "UPDATE_PACKAGES_WITHOUT_USER_ACTION": ["normal", "Allows an application to indicate via"], "USE_BIOMETRIC": ["normal", "Allows an app to use device supported biometric modalities."], "USE_EXACT_ALARM": ["normal", "Allows apps to use exact alarms just like with"], "USE_FINGERPRINT": ["normal", "USE_FINGERPRINT"], "USE_FULL_SCREEN_INTENT": ["normal", "Required for apps targeting"], "USE_ICC_AUTH_WITH_DEVICE_IDENTIFIER": ["signature", "Allows to read device identifiers and use ICC based authentication like EAP-AKA.\n Often required in authentication to access the carrier's server and manage services\n of the subscriber."], "USE_SIP": ["dangerous", "Allows an application to use SIP service."], "UWB_RANGING": ["dangerous", "Required to be able to range to devices using ultra-wideband."], "VIBRATE": ["normal", "Allows access to the vibrator."], "WAKE_LOCK": ["normal", "Allows using PowerManager WakeLocks to keep processor from sleeping or screen\n from dimming."], "WRITE_APN_SETTINGS": ["normal", "Allows applications to write the apn settings and read sensitive fields of\n an existing apn settings like user and password."], "WRITE_CALENDAR": ["dangerous", "Allows an application to write the user's calendar data."], "WRITE_CALL_LOG": ["dangerous", "Allows an application to write (but not read) the user's\n call log data."], "WRITE_CONTACTS": ["dangerous", "Allows an application to write the user's contacts data."], "WRITE_EXTERNAL_STORAGE": ["dangerous", "Allows an application to write to external storage."], "WRITE_GSERVICES": ["normal", "Allows an application to modify the Google service map."], "WRITE_SECURE_SETTINGS": ["normal", "Allows an application to read or write the secure system settings."], "WRITE_SETTINGS": ["signature", "Allows an application to read or write the system settings."], "WRITE_SYNC_SETTINGS": ["normal", "Allows applications to write the sync settings."], "WRITE_VOICEMAIL": ["signature", "Allows an application to modify and remove existing voicemails in the system."]}